"""
請撰寫一程式，以不定數迴圈的方式輸入一個正整數（代表分數），之後根據以下分數與GPA的對照表，印出其所對應的GPA。
假設此不定數迴圈輸入-9999則會結束此迴圈。標準如下表所示：

分數		GPA
90 ~ 100	A
80 ~ 89	B
70 ~ 79	C
60 ~ 69	D
0 ~ 59	E
輸入與輸出會交雜如下，輸出的部份以粗體字表示
75
C
39
E
100
A
85
B
65
D
-9999
"""
while True:
    n = int(input('請輸入分數:'))
    if n == -9999:
        break
    
    if 90 <= n <= 100:
        print("A")
    elif 80 <= n <= 89:
        print("B")
    elif 70 <= n <= 79:
        print("C")
    elif 60 <= n <= 69:
        print("D")
    elif 0 <= n <= 59:
        print("E")